{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.5", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input", "config": {"batch_input_shape": [null, 384, 28, 1], "dtype": "float32", "sparse": false, "name": "input"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input", 0, 0, {}]]], "name": "conv2d_1", "config": {"padding": "same", "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_1", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_constraint": null, "filters": 4}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"padding": "valid", "data_format": "channels_last", "strides": [2, 1], "trainable": true, "pool_size": [2, 1], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"padding": "same", "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_2", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_constraint": null, "filters": 16}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"padding": "valid", "data_format": "channels_last", "strides": [3, 2], "trainable": true, "pool_size": [3, 2], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"padding": "same", "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_3", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_constraint": null, "filters": 16}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "max_pooling2d_3", "config": {"padding": "valid", "data_format": "channels_last", "strides": [3, 2], "trainable": true, "pool_size": [3, 2], "name": "max_pooling2d_3"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"padding": "same", "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_4", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_constraint": null, "filters": 16}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "max_pooling2d_4", "config": {"padding": "valid", "data_format": "channels_last", "strides": [1, 1], "trainable": true, "pool_size": [1, 1], "name": "max_pooling2d_4"}}, {"class_name": "Reshape", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "name": "collapse", "config": {"trainable": true, "target_shape": [21, 112], "name": "collapse"}}, {"class_name": "AttentionDecoder", "inbound_nodes": [[["collapse", 0, 0, {}]]], "name": "attention_32", "config": {"return_state": false, "go_backwards": false, "return_probabilities": false, "stateful": false, "unroll": false, "output_dim": 29, "implementation": 0, "trainable": true, "return_sequences": true, "name": "attention_32", "units": 32}}], "input_layers": [["input", 0, 0]], "name": "model_1", "output_layers": [["attention_32", 0, 0]]}}