_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           (None, 384, 28, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 384, 28, 4)        40        
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 192, 28, 4)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 192, 28, 16)       592       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 64, 14, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 14, 64)        9280      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 16, 7, 64)         0         
_________________________________________________________________
reshape_1 (Reshape)          (None, 16, 448)           0         
_________________________________________________________________
AttentionDecoder (AttentionD (None, 16, 29)            381606    
=================================================================
Total params: 391,518
Trainable params: 391,518
Non-trainable params: 0
_________________________________________________________________
