{"keras_version": "2.1.3", "class_name": "Model", "config": {"output_layers": [["AttentionDecoder", 0, 0]], "input_layers": [["input", 0, 0]], "name": "model_1", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 384, 28, 1], "dtype": "float32", "name": "input", "sparse": false}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 4, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"pool_size": [2, 1], "data_format": "channels_last", "strides": [2, 1], "name": "max_pooling2d_1", "padding": "valid", "trainable": true}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 16, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"pool_size": [3, 2], "data_format": "channels_last", "strides": [3, 2], "name": "max_pooling2d_2", "padding": "valid", "trainable": true}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "filters": 64, "bias_constraint": null, "data_format": "channels_last", "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_size": [3, 3]}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"pool_size": [4, 2], "data_format": "channels_last", "strides": [4, 2], "name": "max_pooling2d_3", "padding": "valid", "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"target_shape": [16, 448], "name": "reshape_1", "trainable": true}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "AttentionDecoder", "class_name": "AttentionDecoder", "config": {"stateful": false, "units": 128, "name": "AttentionDecoder", "return_sequences": true, "return_state": false, "unroll": false, "output_dim": 29, "go_backwards": false, "implementation": 0, "trainable": true, "return_probabilities": false}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}]}, "backend": "tensorflow"}