_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           (None, 384, 28, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 384, 28, 4)        40        
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 192, 28, 4)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 192, 28, 16)       592       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 64, 14, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 14, 16)        2320      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 21, 7, 16)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 21, 7, 20)         2900      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 21, 7, 20)         0         
_________________________________________________________________
collapse (Reshape)           (None, 21, 140)           0         
_________________________________________________________________
attention_50 (AttentionDecod (None, 21, 29)            55980     
=================================================================
Total params: 61,832
Trainable params: 61,832
Non-trainable params: 0
_________________________________________________________________
