{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.5", "config": {"input_layers": [["input", 0, 0]], "output_layers": [["attention_50", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 384, 28, 1], "dtype": "float32", "name": "input", "sparse": false}, "name": "input"}, {"class_name": "Conv2D", "inbound_nodes": [[["input", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_1", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "filters": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null}, "name": "conv2d_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 1], "pool_size": [2, 1], "trainable": true}, "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_2", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null}, "name": "conv2d_2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "strides": [3, 2], "pool_size": [3, 2], "trainable": true}, "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_3", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null}, "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "strides": [3, 2], "pool_size": [3, 2], "trainable": true}, "name": "max_pooling2d_3"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "config": {"dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "bias_constraint": null, "name": "conv2d_4", "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "use_bias": true, "filters": 20, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_regularizer": null}, "name": "conv2d_4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "max_pooling2d_4", "padding": "valid", "strides": [1, 1], "pool_size": [1, 1], "trainable": true}, "name": "max_pooling2d_4"}, {"class_name": "Reshape", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]], "config": {"target_shape": [21, 140], "name": "collapse", "trainable": true}, "name": "collapse"}, {"class_name": "AttentionDecoder", "inbound_nodes": [[["collapse", 0, 0, {}]]], "config": {"units": 50, "return_probabilities": false, "unroll": false, "go_backwards": false, "name": "attention_50", "return_state": false, "stateful": false, "implementation": 0, "return_sequences": true, "output_dim": 29, "trainable": true}, "name": "attention_50"}]}}