_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           (None, 384, 28, 1)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 384, 28, 4)        40        
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 192, 28, 4)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 192, 28, 16)       592       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 64, 14, 16)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 64, 14, 64)        9280      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 21, 7, 64)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 21, 7, 128)        73856     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 21, 7, 128)        0         
_________________________________________________________________
collapse (Reshape)           (None, 21, 896)           0         
_________________________________________________________________
attention_200 (AttentionDeco (None, 21, 29)            1107054   
=================================================================
Total params: 1,190,822
Trainable params: 1,190,822
Non-trainable params: 0
_________________________________________________________________
