{"config": {"name": "model_1", "layers": [{"name": "input", "config": {"name": "input", "batch_input_shape": [null, 384, 28, 1], "sparse": false, "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "conv2d_1", "config": {"name": "conv2d_1", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "filters": 4}, "class_name": "Conv2D", "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 1], "padding": "valid", "pool_size": [2, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "config": {"name": "conv2d_2", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "filters": 16}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "config": {"name": "max_pooling2d_2", "trainable": true, "strides": [3, 2], "padding": "valid", "pool_size": [3, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "config": {"name": "conv2d_3", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "filters": 16}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "config": {"name": "max_pooling2d_3", "trainable": true, "strides": [3, 2], "padding": "valid", "pool_size": [3, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "conv2d_4", "config": {"name": "conv2d_4", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "kernel_regularizer": null, "filters": 16}, "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "config": {"name": "max_pooling2d_4", "trainable": true, "strides": [1, 1], "padding": "valid", "pool_size": [1, 1], "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "collapse", "config": {"name": "collapse", "target_shape": [21, 112], "trainable": true}, "class_name": "Reshape", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "attention_32", "config": {"name": "attention_32", "return_state": false, "trainable": true, "implementation": 0, "unroll": false, "stateful": false, "return_sequences": true, "return_probabilities": false, "go_backwards": false, "output_dim": 29, "units": 32}, "class_name": "AttentionDecoder", "inbound_nodes": [[["collapse", 0, 0, {}]]]}], "output_layers": [["attention_32", 0, 0]], "input_layers": [["input", 0, 0]]}, "keras_version": "2.1.5", "class_name": "Model", "backend": "tensorflow"}